fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CommonModules/ВКМ_ДоработкаДокументаРеализацияТоваровИУслугВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция проверяет наличие существующего документа с данными,
// предлагаемыми к записи.
//
// Параметры:
//   ТекущийОбъект - ДокументОбъект - документ реализации.
//
// Возвращаемое значение:
//   ДокументСсылка, Неопределено - найденный документ или Неопределено.
//
Функция НайтиСуществующийДокументРеализацияСДаннымиТекущегоОбъекта(ТекущийОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО РеализацияТоваровУслугУслуги.Ссылка = РеализацияТоваровУслуг.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата >= &ДатаНачалаПериода
		|	И РеализацияТоваровУслуг.Дата <= &ДатаОкончанияПериода
		|	И РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.Ссылка <> &Ссылка
		|	И РеализацияТоваровУслуг.Договор = &Договор
		|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
		|	И РеализацияТоваровУслуг.Организация = &Организация
		|	И РеализацияТоваровУслуг.Договор.ВидДоговора = 
		|		ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
		|	И РеализацияТоваровУслугУслуги.Номенклатура В (&НоменклатураАбонентскаяПлата, &НоменклатураРаботыСпециалиста)";
	
	Запрос.УстановитьПараметр("ДатаНачалаПериода", НачалоМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", КонецМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("Договор", ТекущийОбъект.Договор); 
	Запрос.УстановитьПараметр("Контрагент", ТекущийОбъект.Контрагент);
	Запрос.УстановитьПараметр("Организация", ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка); 
	Запрос.УстановитьПараметр("НоменклатураАбонентскаяПлата", 
		Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить());
	Запрос.УстановитьПараметр("НоменклатураРаботыСпециалиста", 
		Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить());
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Проверка правильности заполнения документа РеализацияТоваровУслуг.
//
// Параметры:
//   Объект - ДокументОбъект - проверяемый документ.
//
// Возвращаемое значение:
//   Булево - Истина, если документ заполнен верно.
//
Функция ДокументРеализацииТоваровИУслугЗаполненВерно(Знач Объект) Экспорт
	
	// Проверить заполненность поля договор
	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда	
		ТекстСообщения = "Ошибка. Не указан договор";
		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения, Объект.Ссылка, "Объект.Договор", "Объект.Договор");
		Возврат Ложь;
	КонецЕсли;
	
	// Проверить вид договора
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ВидДоговора") 
		<> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		ТекстСообщения = "Должен быть договор абонентского обслуживания";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.Договор");
		Возврат Ложь;
		
	КонецЕсли;
	
	// Проверить действие договора
	ДатаНачалИДатаОкончанияДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Объект.Договор, 
		"ВКМ_ДатаНачалаДействияДоговора,ВКМ_ДатаОкончанияДействияДоговора");
	
	Если ДатаНачалИДатаОкончанияДоговора.ВКМ_ДатаНачалаДействияДоговора > Объект.Дата 
		ИЛИ ДатаНачалИДатаОкончанияДоговора.ВКМ_ДатаОкончанияДействияДоговора < Объект.Дата Тогда
		
		ТекстСообщения = "Выбранный договор не действителен на дату документа.
			|Создание документа реализации товаров и услуг невозможно.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.Договор");
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьДополнительныеЭлементыФормы(Форма) Экспорт
	
	// Дополнительная кнопка
	КомандаЗаполнить = Форма.Команды.Добавить("Заполнить");
	КомандаЗаполнить.Действие = "ВКМ_ВыполнитьКомандуЗаполнить";
	КомандаЗаполнить.Заголовок = "Заполнить";
	
	КнопкаЗаполнить = Форма.Элементы.Добавить(
		"КнопкаСформироватьТаблицу", 
		Тип("КнопкаФормы"), 
		Форма.Элементы.ФормаКоманднаяПанель);
	КнопкаЗаполнить.ИмяКоманды = "Заполнить"; 
	
	// Для удобства перейти к закладке Услуги
	Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.ГруппаУслуги;
	
КонецПроцедуры

#КонецОбласти
